In [1]:
## Importing Pandas Library
import pandas as pd

## Importing the LabelEncoder() for categorical to quantitative value conversion
from sklearn.preprocessing import LabelEncoder

In [2]:
data = {'Name': ['Hitesh','Tanishka','Shubham','Tanishq','Manish','Divesh','Nanci'],
        'Age': [21,20,21,21,21,19,19],
        'Gender': ['M','F','M','M','M','M','F'],
        'Marks': [90, 89, 'NaN', 85, 80, 'NaN', 88]}

In [3]:
## Loading data to dataframe variable

dataframe = pd.DataFrame(data)

In [4]:
## Displays the first 5 rows of the data
dataframe.head()

       Name  Age Gender Marks
0    Hitesh   21      M    90
1  Tanishka   20      F    89
2   Shubham   21      M   NaN
3   Tanishq   21      M    85
4    Manish   21      M    80

In [5]:
## It shows the data-type of all the columns
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      object
 3   Marks   7 non-null      object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [6]:
## Its shows all the statistical data of columns
dataframe.describe()

             Age
count   7.000000
mean   20.285714
std     0.951190
min    19.000000
25%    19.500000
50%    21.000000
75%    21.000000
max    21.000000

In [7]:
## .isnull() Checks for null values in the data, 
## .sum() sums up the null values in the data
dataframe.isnull().sum()

Name      0
Age       0
Gender    0
Marks     0
dtype: int64

In [8]:
## It Shows how many columns and rows are there in the data '.shape'
dataframe.shape

(7, 4)

In [9]:
## le is defined as LabelEncoder()
## LabelEncoder() changes the categorical values to quantitative values
le = LabelEncoder()

## Gender column is now transformed into quantitative values (0's, 1's)
dataframe['Gender'] = le.fit_transform(dataframe['Gender'])

In [10]:
## Displaying the transformed data
dataframe

       Name  Age  Gender Marks
0    Hitesh   21       1    90
1  Tanishka   20       0    89
2   Shubham   21       1   NaN
3   Tanishq   21       1    85
4    Manish   21       1    80
5    Divesh   19       1   NaN
6     Nanci   19       0    88

In [11]:
## Displaying the transformed data-types of columns
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      int32
 3   Marks   7 non-null      object
dtypes: int32(1), int64(1), object(2)
memory usage: 324.0+ bytes

In [12]:
## Changing 'NaN' to 0 , giving proper datatype to the columns
dataframe.replace(to_replace = 'NaN', value = 0, inplace = True)

In [13]:
dataframe

       Name  Age  Gender  Marks
0    Hitesh   21       1     90
1  Tanishka   20       0     89
2   Shubham   21       1      0
3   Tanishq   21       1     85
4    Manish   21       1     80
5    Divesh   19       1      0
6     Nanci   19       0     88

In [14]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Gender  7 non-null      int32
 3   Marks   7 non-null      int64
dtypes: int32(1), int64(2), object(1)
memory usage: 324.0+ bytes

In [ ]:
## if marks are being shown as object run this command to change data type of marks column
## dataframe['Marks'] = dataframe['Marks'].astype('int')